<img src="img/Recurso-26.png" width="200">

## TERCER MODULO - Estructuras de datos, +Pandas

![logo](img/python_logo.png)

*Santiago Carrasco*

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'2.3.3'

### Operaciones en pandas

#### Búsqueda

In [5]:
rand_matrix = np.random.randint(6,size=(2,3))
frame = pd.DataFrame(rand_matrix , columns=list('ABC'))
display(frame)

   A  B  C
0  5  5  0
1  1  2  0

In [6]:
# buscando columnas (DataFrame como dic, busca en claves)
'A' in frame

True

In [7]:
# buscando valores
display(frame.isin([3,2])) # --> mask de respuesta (valores que son 3 o 2)

       A      B      C
0  False  False  False
1  False   True  False

In [8]:
# Contar el número de ocurrencias
print(frame.isin([4]).values.sum())
display(frame.isin([4])) #devuelve una mask con valores true si el elemento es 4
print(frame.isin([4]).values)
type(frame.isin([4]).values) # pandas es una capa alrededor de numpy

0

       A      B      C
0  False  False  False
1  False  False  False

[[False False False]
 [False False False]]

numpy.ndarray

In [9]:
# Cuántos valores son >= 2
mask = frame >= 2
print(mask.values.sum())
display(mask)

3

       A     B      C
0   True  True  False
1  False  True  False

#### Ordenación

In [10]:
from random import shuffle
rand_matrix = np.random.randint(20,size=(5,4))
indices = list(range(5))
shuffle(indices) # mezcla indices
frame = pd.DataFrame(rand_matrix , columns=list('DACB'), index=indices)
display(frame)

    D   A   C   B
4   4   4  16   6
2  13   6  15  14
3   3  16   1  16
1  12   2  10  10
0  15   0   2   2

In [11]:
# ordenar por índice
display(frame.sort_index(ascending=False))
display(frame)

    D   A   C   B
4   4   4  16   6
3   3  16   1  16
2  13   6  15  14
1  12   2  10  10
0  15   0   2   2

    D   A   C   B
4   4   4  16   6
2  13   6  15  14
3   3  16   1  16
1  12   2  10  10
0  15   0   2   2

In [12]:
#ordenar por columna
display(frame.sort_index(axis=1, ascending=False))

    D   C   B   A
4   4  16   6   4
2  13  15  14   6
3   3   1  16  16
1  12  10  10   2
0  15   2   2   0

In [13]:
#ordenar por columna
display(frame.sort_index(axis=1, ascending=False))

    D   C   B   A
4   4  16   6   4
2  13  15  14   6
3   3   1  16  16
1  12  10  10   2
0  15   2   2   0

In [14]:
# ordenar filas por valor en columna
display(frame.sort_values(by='A', ascending=True))

    D   A   C   B
0  15   0   2   2
1  12   2  10  10
4   4   4  16   6
2  13   6  15  14
3   3  16   1  16

In [15]:
# ordenar columnas por valor en fila
display(frame.sort_values(by=1, axis=1, ascending=True))

    A   C   B   D
4   4  16   6   4
2   6  15  14  13
3  16   1  16   3
1   2  10  10  12
0   0   2   2  15

In [16]:
# ordenar por valor en columna y guardar cambios
frame.sort_values(by='A', ascending=False, inplace=True)
display(frame)

    D   A   C   B
3   3  16   1  16
2  13   6  15  14
4   4   4  16   6
1  12   2  10  10
0  15   0   2   2

#### Ranking

* Construir un ranking de valores

In [17]:
display(frame)

    D   A   C   B
3   3  16   1  16
2  13   6  15  14
4   4   4  16   6
1  12   2  10  10
0  15   0   2   2

In [18]:
display(frame.rank(method='max', axis=1))

     D    A    C    B
3  2.0  4.0  1.0  4.0
2  2.0  1.0  4.0  3.0
4  2.0  2.0  4.0  3.0
1  4.0  1.0  3.0  3.0
0  4.0  1.0  3.0  3.0

In [19]:
# Imprimir, uno a uno, los valores de la columna 'C' de mayor a menor
for x in frame.sort_values(by='C', ascending=False)['C'].values:
    print(x)

16
15
10
2
1

#### Operaciones

Operaciones matemáticas entre objetos

In [21]:
matrixA = np.random.randint(100,size=(4,4))
matrixB = np.random.randint(100,size=(4,4))
frameA = pd.DataFrame(matrixA)
frameB = pd.DataFrame(matrixB)
display(frameA)
display(frameB)

    0   1   2   3
0  23  51  20  37
1  44  54  94   3
2  10   2  34  69
3  18  18  35  78

    0   1   2   3
0  62  81  24  13
1  87   9  49  79
2  78  25  13  45
3  32  19  97  46

In [22]:
# a través de métodos u operadores
display(frameA + frameB == frameA.add(frameB))
display(frameA + frameB)

      0     1     2     3
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True

     0    1    2    3
0   85  132   44   50
1  131   63  143   82
2   88   27   47  114
3   50   37  132  124

In [23]:
display(frameB - frameA == frameB.sub(frameA))
display(frameB - frameA)

      0     1     2     3
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True

    0   1   2   3
0  39  30   4 -24
1  43 -45 -45  76
2  68  23 -21 -24
3  14   1  62 -32

In [24]:
# si los frames no son iguales, valor por defecto NaN
frameC = pd.DataFrame(np.random.randint(100,size=(3,3)))
display(frameA)
display(frameC)
display(frameC + frameA)

    0   1   2   3
0  23  51  20  37
1  44  54  94   3
2  10   2  34  69
3  18  18  35  78

    0   1   2
0  75  85  56
1  55  73  83
2  69  88  66

      0      1      2   3
0  98.0  136.0   76.0 NaN
1  99.0  127.0  177.0 NaN
2  79.0   90.0  100.0 NaN
3   NaN    NaN    NaN NaN

In [25]:
# se puede especificar el valor por defecto con el argumento fill_value
display(frameA.add(frameC, fill_value=0))

      0      1      2     3
0  98.0  136.0   76.0  37.0
1  99.0  127.0  177.0   3.0
2  79.0   90.0  100.0  69.0
3  18.0   18.0   35.0  78.0

Operadores aritméticos solo válidos en elementos aceptables

In [ ]:
frameD = pd.DataFrame({0: ['a','b'],1:['d','f']})
display(frameD)
frameA - frameD

Operaciones entre Series y DataFrame

In [28]:
rand_matrix = np.random.randint(10, size=(3, 4))
df = pd.DataFrame(rand_matrix , columns=list('ABCD'))
display(df)
display(df.iloc[0])
display(type(df.iloc[0]))
# uso común, averiguar la diferencia entre una fila y el resto
display(df - df.iloc[0])
display(df.sub(df.iloc[0], axis=1))
# Por columnas cómo se restaría
display(df.sub(df['A'], axis=0))

   A  B  C  D
0  2  1  5  9
1  2  3  7  0
2  6  6  0  0

A    2
B    1
C    5
D    9
Name: 0, dtype: int32

pandas.core.series.Series

   A  B  C  D
0  0  0  0  0
1  0  2  2 -9
2  4  5 -5 -9

   A  B  C  D
0  0  0  0  0
1  0  2  2 -9
2  4  5 -5 -9

   A  B  C  D
0  0 -1  3  7
1  0  1  5 -2
2  0  0 -6 -6

pandas se basa en NumPy, np operadores binarios y unarios son aceptables

In [30]:
import pandas as pd

datos = [
# UNARIO
["Unario", "abs", "Valor absoluto de cada elemento"],
["", "sqrt", "Raíz cuadrada de cada elemento"],
["", "exp", "e^x, siendo x cada elemento"],
["", "log, log10, log2", "Logaritmos en distintas bases de cada elemento"],
["", "sign", "Retorna el signo de cada elemento (-1 para negativo, 0 o 1 para positivo)"],
["", "ceil", "Redondea cada elemento por arriba"],
["", "floor", "Redondea cada elemento por abajo"],
["", "isnan", "Retorna si cada elemento es Nan"],
["", "cos, sin, tan", "Operaciones trigonométricas en cada elemento"],
["", "arccos, arcsin, arctan", "Inversas de operaciones trigonométricas en cada elemento"],

# BINARIO
["Binario", "add", "Suma de dos arrays"],
["", "substract", "Resta de dos arrays"],
["", "multiply", "Multiplicación de dos arrays"],
["", "divide", "División de dos arrays"],
["", "maximum, minimum", "Retorna el valor máximo/mínimo de cada pareja de elementos"],
]

tabla = pd.DataFrame(datos, columns=["Tipo", "Operación", "Descripción"])

display(tabla)

,Tipo,Operación,Descripción
0,Unario,abs,Valor absoluto de cada elemento
1,,sqrt,Raíz cuadrada de cada elemento
2,,exp,"e^x, siendo x cada elemento"
3,,"log, log10, log2",Logaritmos en distintas bases de cada elemento
4,,sign,Retorna el signo de cada elemento (-1 para neg...
5,,ceil,Redondea cada elemento por arriba
6,,floor,Redondea cada elemento por abajo
7,,isnan,Retorna si cada elemento es Nan
8,,"cos, sin, tan",Operaciones trigonométricas en cada elemento
9,,"arccos, arcsin, arctan",Inversas de operaciones trigonométricas en cad...
10,Binario,add,Suma de dos arrays
11,,substract,Resta de dos arrays
12,,multiply,Multiplicación de dos arrays
13,,divide,División de dos arrays
14,,"maximum, minimum",Retorna el valor máximo/mínimo de cada pareja ...

In [31]:
import pandas as pd

datos = [
["", "equal, not_equal", "Retorna la comparación (igual o no igual) de cada pareja de elementos"],
["", "greater, greater_equal, less, less_equal", "Retorna la comparación (>, >=, <, <= respectivamente) de cada pareja de elementos"],
]

tabla = pd.DataFrame(datos, columns=["Tipo", "Operación", "Descripción"])

display(tabla)

,Tipo,Operación,Descripción
0,,"equal, not_equal",Retorna la comparación (igual o no igual) de c...
1,,"greater, greater_equal, less, less_equal","Retorna la comparación (>, >=, <, <= respectiv..."

Aplicación de funciones a medida con lambda

In [33]:
rand_matrix = np.random.randint(10, size=(3, 4))
frame = pd.DataFrame(rand_matrix , columns=list('ABCD'))
display(frame)
print(frame.apply(lambda x : x.max() - x.min(), axis = 1)) # diferencia por colu

   A  B  C  D
0  6  1  4  5
1  1  5  9  9
2  3  9  8  0

0    5
1    8
2    9
dtype: int64

In [34]:
def max_min(x):
    return x.max() - x.min()
print(frame.apply(max_min, axis = 0)) # diferencia por columna

A    5
B    8
C    5
D    9
dtype: int64

In [35]:
# diferencia entre min y max por fila (no columna)
rand_matrix = np.random.randint(10, size=(3, 4))
frame = pd.DataFrame(rand_matrix , columns=list('ABCD'))
display(frame)
print(frame.apply(lambda x : x.max() - x.min(), axis = 1)) # diferencia por fila

   A  B  C  D
0  4  1  7  4
1  9  8  7  9
2  0  5  1  9

0    6
1    2
2    9
dtype: int64

#### Estadística descriptiva

* Análisis preliminar de los datos
* Para Series y DataFrame

In [36]:
import pandas as pd

datos = [
["count", "Número de valores no NaN"],
["describe", "Conjunto de estadísticas sumarias"],
["min, max", "Valores mínimo y máximo"],
["argmin, argmax", "Índices posicionales del valor mínimo y máximo"],
["idxmin, idxmax", "Índices semánticos del valor mínimo y máximo"],
["sum", "Suma de los elementos"],
["mean", "Media de los elementos"],
["median", "Mediana de los elementos"],
["mad", "Desviación absoluta media del valor medio"],
["var", "Varianza de los elementos"],
["std", "Desviación estándar de los elementos"],
["cumsum", "Suma acumulada de los elementos"],
]

tabla = pd.DataFrame(datos, columns=["Operación", "Descripción"])

display(tabla)

         Operación                                     Descripción
0            count                        Número de valores no NaN
1         describe               Conjunto de estadísticas sumarias
2         min, max                         Valores mínimo y máximo
3   argmin, argmax  Índices posicionales del valor mínimo y máximo
4   idxmin, idxmax    Índices semánticos del valor mínimo y máximo
5              sum                           Suma de los elementos
6             mean                          Media de los elementos
7           median                        Mediana de los elementos
8              mad       Desviación absoluta media del valor medio
9              var                       Varianza de los elementos
10             std            Desviación estándar de los elementos
11          cumsum                 Suma acumulada de los elementos

In [37]:
import pandas as pd

datos = [
["diff", "Diferencia aritmética de los elementos"],
]

tabla = pd.DataFrame(datos, columns=["Operación", "Descripción"])

display(tabla)

  Operación                             Descripción
0      diff  Diferencia aritmética de los elementos

In [41]:
diccionario = { "nombre" : ["Marisa","Laura","Manuel","Carlos"], 
"edad" : [34,30,25,28],
"puntos" : [98,12,98,np.nan], 
"genero" : ["F", "F", "M", "M"] }

frame = pd.DataFrame(diccionario)
display(frame)
display(frame.describe())  # datos generales de elementos

   nombre  edad  puntos genero
0  Marisa    34    98.0      F
1   Laura    30    12.0      F
2  Manuel    25    98.0      M
3  Carlos    28     NaN      M

            edad     puntos
count   4.000000   3.000000
mean   29.250000  69.333333
std     3.774917  49.652123
min    25.000000  12.000000
25%    27.250000  55.000000
50%    29.000000  98.000000
75%    31.000000  98.000000
max    34.000000  98.000000

In [42]:
# operadores básicos
print(frame.sum())
display(frame)
print(frame.sum(axis=1, numeric_only=True))

nombre    MarisaLauraManuelCarlos
edad                          117
puntos                      208.0
genero                       FFMM
dtype: object

   nombre  edad  puntos genero
0  Marisa    34    98.0      F
1   Laura    30    12.0      F
2  Manuel    25    98.0      M
3  Carlos    28     NaN      M

0    132.0
1     42.0
2    123.0
3     28.0
dtype: float64

In [43]:
frame.mean(numeric_only=True)

edad      29.250000
puntos    69.333333
dtype: float64

In [44]:
frame.cumsum()

                    nombre  edad  puntos genero
0                   Marisa    34    98.0      F
1              MarisaLaura    64   110.0     FF
2        MarisaLauraManuel    89   208.0    FFM
3  MarisaLauraManuelCarlos   117     NaN   FFMM

In [45]:
frame.count(axis=1)

0    4
1    4
2    4
3    3
dtype: int64

In [46]:
print(frame['edad'].std())

3.774917217635375

In [47]:
frame['edad'].idxmax()

0

In [48]:
frame['puntos'].idxmin()

1

In [49]:
# frame con las filas con los valores maximos de una columna
print(frame['puntos'].max())
display(frame[frame['puntos'] == frame['puntos'].max()])

98.0

   nombre  edad  puntos genero
0  Marisa    34    98.0      F
2  Manuel    25    98.0      M

In [50]:
frame["ranking"] = frame["puntos"].rank(method='max')

In [51]:
display(frame)

   nombre  edad  puntos genero  ranking
0  Marisa    34    98.0      F      3.0
1   Laura    30    12.0      F      1.0
2  Manuel    25    98.0      M      3.0
3  Carlos    28     NaN      M      NaN

### Agregaciones

In [52]:
display(frame)
df = frame.groupby('genero').count()
display(df)

   nombre  edad  puntos genero  ranking
0  Marisa    34    98.0      F      3.0
1   Laura    30    12.0      F      1.0
2  Manuel    25    98.0      M      3.0
3  Carlos    28     NaN      M      NaN

        nombre  edad  puntos  ranking
genero
F            2     2       2        2
M            2     2       1        1

In [53]:
# si es Nan descarta la fila
df = frame.groupby('puntos').count()
display(df)

        nombre  edad  genero  ranking
puntos
12.0         1     1       1        1
98.0         2     2       2        2

In [54]:
display(frame.groupby('genero').mean(numeric_only=True))

        edad  puntos  ranking
genero
F       32.0    55.0      2.0
M       26.5    98.0      3.0

In [55]:
display(frame.groupby('genero').max())

        nombre  edad  puntos  ranking
genero
F       Marisa    34    98.0      3.0
M       Manuel    28    98.0      3.0

In [56]:
# Filtrado de los datos en el que el conjunto no supera una media determinada 
def media(x):
    return x["edad"].mean() > 30
display(frame)
frame.groupby('genero').filter(media)

   nombre  edad  puntos genero  ranking
0  Marisa    34    98.0      F      3.0
1   Laura    30    12.0      F      1.0
2  Manuel    25    98.0      M      3.0
3  Carlos    28     NaN      M      NaN

   nombre  edad  puntos genero  ranking
0  Marisa    34    98.0      F      3.0
1   Laura    30    12.0      F      1.0

### Correlaciones

pandas incluye métodos para analizar correlaciones
* Relación matemática entre dos variables (-1 negativamente relacionadas, 1
* positivamente relacionadas, 0 sin relación)
* obj.corr(obj2) --> medida de correlación entre los datos de ambos objetos
* https://blogs.oracle.com/ai-and-datascience/post/introduction-to-correlation

### Ejemplo Fuel efficiency

* https://archive.ics.uci.edu/ml/datasets/Auto+MPG

In [58]:
import pandas as pd

path = "http://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.data"

mpg_data = pd.read_csv(path, sep='\s+', header=None,
                       names=['mpg', 'cilindros', 'desplazamiento', 'potencia',
                              'peso', 'aceleracion', 'año', 'origen', 'nombre'],
                       na_values='?', engine='c')

In [59]:
display(mpg_data.sample(5))

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion,año,origen,nombre
54,35.0,4,72.0,69.0,1613.0,18.0,71,3,datsun 1200
163,18.0,6,225.0,95.0,3785.0,19.0,75,1,plymouth fury
386,25.0,6,181.0,110.0,2945.0,16.4,82,1,buick century limited
263,17.7,6,231.0,165.0,3445.0,13.4,78,1,buick regal sport coupe (turbo)
363,22.4,6,231.0,110.0,3415.0,15.8,81,1,buick century

In [60]:
display(mpg_data.describe(include='all'))

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion,año,origen,nombre
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000,398.000000,398
unique,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,305
top,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,ford pinto
freq,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050,1.572864,NaN
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627,0.802055,NaN
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000,1.000000,NaN
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000,1.000000,NaN
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000,1.000000,NaN
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000,2.000000,NaN
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000,3.000000,NaN

In [61]:
mpg_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   mpg             398 non-null    float64
 1   cilindros       398 non-null    int64
 2   desplazamiento  398 non-null    float64
 3   potencia        392 non-null    float64
 4   peso            398 non-null    float64
 5   aceleracion     398 non-null    float64
 6   año             398 non-null    int64
 7   origen          398 non-null    int64
 8   nombre          398 non-null    object
dtypes: float64(5), int64(3), object(1)
memory usage: 28.1+ KB

### Correlaciones entre valores

In [62]:
mpg_data['mpg'].corr(mpg_data['peso']) # + mpg = - peso

np.float64(-0.8317409332443351)

In [63]:
mpg_data['peso'].corr(mpg_data['aceleracion']) # + peso = - aceleracion

np.float64(-0.4174573199403932)

### Correlaciones entre todos los valores

In [64]:
mpg_data.corr(numeric_only=True)

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion,año,origen
mpg,1.000000,-0.775396,-0.804203,-0.778427,-0.831741,0.420289,0.579267,0.563450
cilindros,-0.775396,1.000000,0.950721,0.842983,0.896017,-0.505419,-0.348746,-0.562543
desplazamiento,-0.804203,0.950721,1.000000,0.897257,0.932824,-0.543684,-0.370164,-0.609409
potencia,-0.778427,0.842983,0.897257,1.000000,0.864538,-0.689196,-0.416361,-0.455171
peso,-0.831741,0.896017,0.932824,0.864538,1.000000,-0.417457,-0.306564,-0.581024
aceleracion,0.420289,-0.505419,-0.543684,-0.689196,-0.417457,1.000000,0.288137,0.205873
año,0.579267,-0.348746,-0.370164,-0.416361,-0.306564,0.288137,1.000000,0.180662
origen,0.563450,-0.562543,-0.609409,-0.455171,-0.581024,0.205873,0.180662,1.000000

In [65]:
#año y origen no parecen correlacionables
#eliminar columnas de la correlacion
corr_data = mpg_data.drop(['año','origen'],axis=1).corr(numeric_only=True)
display(corr_data)

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion
mpg,1.000000,-0.775396,-0.804203,-0.778427,-0.831741,0.420289
cilindros,-0.775396,1.000000,0.950721,0.842983,0.896017,-0.505419
desplazamiento,-0.804203,0.950721,1.000000,0.897257,0.932824,-0.543684
potencia,-0.778427,0.842983,0.897257,1.000000,0.864538,-0.689196
peso,-0.831741,0.896017,0.932824,0.864538,1.000000,-0.417457
aceleracion,0.420289,-0.505419,-0.543684,-0.689196,-0.417457,1.000000

In [66]:
# representación gráfica matplotlib
import matplotlib.pyplot as plt

Matplotlib is building the font cache; this may take a moment.

In [67]:
# representación gráfica
corr_data.style.background_gradient(cmap=plt.get_cmap('RdYlGn'), axis=1)

In [68]:
# correlación más negativa
mpg_data.drop(['año','origen'],axis=1).corr(numeric_only=True).idxmin()

mpg                   peso
cilindros              mpg
desplazamiento         mpg
potencia               mpg
peso                   mpg
aceleracion       potencia
dtype: object

In [69]:
# correlación más positiva
mpg_data.drop(['año','origen'],axis=1).corr(numeric_only=True).idxmax()

mpg                          mpg
cilindros              cilindros
desplazamiento    desplazamiento
potencia                potencia
peso                        peso
aceleracion          aceleracion
dtype: object

In [70]:
# tabla similar con las correlaciones más positivas (evitar parejas del mismo va
positive_corr = mpg_data.drop(['año','origen'],axis=1).corr(numeric_only=True)
np.fill_diagonal(positive_corr.values, 0)
display(positive_corr)
positive_corr.idxmax()

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion
mpg,0.000000,-0.775396,-0.804203,-0.778427,-0.831741,0.420289
cilindros,-0.775396,0.000000,0.950721,0.842983,0.896017,-0.505419
desplazamiento,-0.804203,0.950721,0.000000,0.897257,0.932824,-0.543684
potencia,-0.778427,0.842983,0.897257,0.000000,0.864538,-0.689196
peso,-0.831741,0.896017,0.932824,0.864538,0.000000,-0.417457
aceleracion,0.420289,-0.505419,-0.543684,-0.689196,-0.417457,0.000000

mpg                  aceleracion
cilindros         desplazamiento
desplazamiento         cilindros
potencia          desplazamiento
peso              desplazamiento
aceleracion                  mpg
dtype: object